# PathOfTravelCalculationServerIds Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PathOfTravelCalculationServerIds Properties
PathOfTravelCalculationServerIds Class See Also
---
The PathOfTravelCalculationServerIds type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DefaultPathOfTravelCalculationGUID | GUID to represent the default calculation server id. |

# See Also
PathOfTravelCalculationServerIds Class
Autodesk.Revit.DB.Analysis Namespace